const questions = [
  { q: "প্রার্থনা সমাজ কে প্রতিষ্ঠা করেন?", options: ["বিবেকানন্দ", "আত্মারাম পাণ্ডুরং", "মহাত্মা গান্ধী", "অরবিন্দ ঘোষ"], answer: 1 },

  { q: "কোলেরু হ্রদ ভারতের কোন রাজ্যে অবস্থিত?", options: ["পশ্চিমবঙ্গ", "ওড়িশা", "অন্ধ্রপ্রদেশ", "কর্ণাটক"], answer: 2 },

  { q: "500 অপেক্ষা ছোট কোন সংখ্যা 6, 16, 20 দ্বারা বিভাজ্য হবে?", options: ["420", "440", "460", "480"], answer: 3 },

  { q: "5, 25, 61, 113, 181, ?", options: ["200", "228", "265", "321"], answer: 2 },

  { q: "রামনাথ কোবিন্দ দেশের কততম রাষ্ট্রপতি?", options: ["ত্রয়োদশ", "চতুর্দশ", "পঞ্চদশ", "ষষ্ঠদশ"], answer: 1 },

  { q: "একটি অফিসে 17 জন কাজ করেন। নববর্ষের শুরুতে একে অপরকে গ্রিটিংস কার্ড দিলে মোট কটি কার্ডের প্রয়োজন?", options: ["34 টি", "136 টি", "272 টি", "289 টি"], answer: 2 },

  { q: "একজন ব্যাটসম্যানের প্রথম 8 টি ইনিংসের গড় 20.5, নবম ইনিংসে কত রান করলে তার রানের গড় বেড়ে 23 হবে?", options: ["41", "43", "45", "47"], answer: 1 },

  { q: "নীলনদ কোন সাগরে পতিত হয়েছে?", options: ["আরব সাগরে", "ভূমধ্য সাগরে", "লোহিত সাগরে", "ভারত মহাসাগরে"], answer: 1 },

  { q: "দিলীপ, রাম এবং অমর একটি যৌথ ব্যবসায় 2700 টাকা, 8100 টাকা এবং 7200 টাকা বিনিয়োগ করে। বছর শেষে যদি রাম 3600 টাকা লভ্যাংশ পায় তবে মোট লভ্যাংশ কত?", options: ["8000 টাকা", "10800 টাকা", "11600 টাকা", "এর কোনটিই নয়"], answer: 0 },

  { q: "কোন ভিটামিন রক্ত জমাট বাঁধতে সাহায্য করে?", options: ["ভিটামিন A", "ভিটামিন B", "ভিটামিন C", "ভিটামিন K"], answer: 3 },

  { q: "সাহেব, সুজনের চেয়ে 7 বছরের ছোট। তাদের বয়সের অনুপাত 7 : 9, সাহেবের বয়স কত বছর?", options: ["12 বছর 6 মাস", "14 বছর 6 মাস", "23 বছর 6 মাস", "24 বছর 6 মাস"], answer: 3 },

  { q: "কোন গুপ্ত সম্রাট শকারি উপাধি গ্রহণ করেন?", options: ["স্কন্দগুপ্ত", "সমুদ্রগুপ্ত", "প্রথম চন্দ্রগুপ্ত", "দ্বিতীয় চন্দ্রগুপ্ত"], answer: 3 },

  { q: "বেরিবেরি রোগ কোন ভিটামিনের অভাবে হয়?", options: ["ভিটামিন বি১", "ভিটামিন বি২", "ভিটামিন বি৫", "ভিটামিন বি১২"], answer: 0 },

  { q: "নর্মদা নদীর উৎপত্তি কোন পর্বত থেকে?", options: ["অমরকণ্টক", "সাতপুরা", "মহেন্দ্রগিরি", "মহাদেব পাহাড়"], answer: 0 },

  { q: "পরিকল্পনা কমিশন কবে স্থাপিত হয়?", options: ["মার্চ 1950", "মার্চ 1951", "মার্চ 1952", "মার্চ 1953"], answer: 0 },

  { q: "ফলিক অ্যাসিডের প্রধান উৎস কী?", options: ["পালং শাক", "গাজর", "পেঁপে", "কলা"], answer: 0 },

  { q: "দ্রোণাচার্য পুরস্কার কাদের দেওয়া হয়?", options: ["খেলার কোচেদের", "চিকিৎসকদের", "খেলোয়াড়দের", "কোনটিই নয়"], answer: 0 },

  { q: "পাখির পায়ের ন্যায় ব-দ্বীপ কোথায় দেখা যায়?", options: ["গোদাবরী নদীতে", "কৃষ্ণা নদীতে", "কাবেরী নদীতে", "সিন্ধু নদীতে"], answer: 1 },

  { q: "স্বাধীনতা হীনতায় কে বাঁচিতে চায় হে এই বিখ্যাত পঙক্তিটি কার?", options: ["রঙ্গলাল বন্দ্যোপাধ্যায়", "কাজী নজরুল ইসলাম", "নেতাজি সুভাষচন্দ্র বোস", "কামিনী রায়"], answer: 0 },

  { q: "31 কে এমন দুটি অংশে ভাগ কর যার একটি অংশ অপরটির 24% হয়। তবে সংখ্যা দুটি কি কি?", options: ["22, 9", "24, 7", "25, 6", "27, 4"], answer: 2 },

  { q: "অ্যাভোগাড্রোর সূত্র কোনটির ওপর প্রযোজ্য?", options: ["বায়বীয় পদার্থ", "কঠিন পদার্থ", "তরল পদার্থ", "কঠিন ও তরল পদার্থ"], answer: 0 },

  { q: "উত্তরপ্রদেশের রাজধানীর নাম কী?", options: ["লক্ষ্ণৌ", "পাটনা", "বেনারস", "এলাহাবাদ"], answer: 0 },

  { q: "কোন ভিটামিনকে আলফা টোকোফেরল বলা হয়?", options: ["ভিটামিন – এ", "ভিটামিন – বি", "ভিটামিন – ই", "ভিটামিন – কে"], answer: 2 },

  { q: "দুধের মধ্যে যে অল্প পরিমাণ শর্করা থাকে তাকে কী বলা হয়?", options: ["গ্লুকোজ", "ফ্রুকটোজ", "সুক্রোজ", "ল্যাকটোজ"], answer: 3 },

  { q: "শ্রী সুজন ও শ্রীমতী সুজনের তিনটি কন্যা আছে ও প্রত্যেক কন্যার একটি করে শিশু আছে। তাহলে ওই পরিবারে মোট কতজন সদস্য আছে?", options: ["6", "7", "8", "9"], answer: 2 },

  { q: "আয়োডিন কে আবিষ্কার করেন?", options: ["বার্নার্ড করটয়স", "হেনিং ব্র্যান্ড", "স্যার হামফ্রি ডেভি", "জর্জ ব্র্যান্ড"], answer: 0 },

  { q: "এক ব্যক্তি 515 টাকায় একটি দ্রব্য বিক্রয় করে যত পরিমাণ লাভ হয়, 475 টাকায় বিক্রয় করলে সমপরিমাণ ক্ষতি হয়। দ্রব্যটি 40% লাভে বিক্রয় করলে, বিক্রয়মূল্য কত হবে?", options: ["673 টাকা", "683 টাকা", "693 টাকা", "707 টাকা"], answer: 2 },

  { q: "দুটি সংখ্যার গুণফল 84942। সংখ্যা দুটির গ.সা.গু. 33 হলে, ল.সা.গু. কত?", options: ["1365", "1574", "2500", "2574"], answer: 3 },

  { q: "কিছু সংখ্যক লোক 75 দিনে একটি কাজ করে। যদি আরও 6 জন লোক বেশী নিযুক্ত হয়, তবে কাজ শেষ করতে 15 দিন কম লাগে। তবে প্রথমে কতজন লোক ছিল?", options: ["20জন", "24জন", "28জন", "32জন"], answer: 1 },

  { q: "30 টাকা কিলোগ্রাম দরের চালের সঙ্গে 25 টাকা কিলোগ্রাম দরের চাল কী অনুপাতে মেশালে মিশ্র চালের দাম প্রতি কিলোগ্রাম 27 টাকা হবে?", options: ["2:3", "3:4", "4:5", "5:6"], answer: 0 },

  { q: "আলফা কেরাটিন প্রোটিনের উপস্থিতি কোথায় দেখা যায়?", options: ["দুধে", "রক্তে", "ত্বকে", "ডিমে"], answer: 2 },

  { q: "KMQS : MPVZ :: ? : ?", options: ["BCEG : CFIM", "ECKM : GJPT", "GILN : IKOR", "QSXZ : SAWU"], answer: 0 },

  { q: "গৌরাঙ্গ ও দীপায়ন দোকান থেকে কিছু ক্রয় করার জন্য বাইসাইকেল করে উত্তরাভিমুখে গেল। তারপর বাঁদিকে ঘুরে পূর্ব পথের সমান্তরালে 2 কিমি পথ গিয়ে দেখল যে তারা তাদের পূর্বস্থান থেকে পশ্চিমদিকে মাত্র 1 কিমি দূরে আছে। তবে উত্তরাভিমুখে কতটা পথ গিয়েছিল?", options: ["১ কিমি", "২ কিমি", "৩ কিমি", "৪ কিমি"], answer: 1 },

  { q: "পেরিয়ার অভয়ারণ্যটি কোন রাজ্যে অবস্থিত?", options: ["পশ্চিমবঙ্গ", "উত্তরাঞ্চল", "কেরল", "মধ্যপ্রদেশ"], answer: 2 },

  { q: "A এবং B একটি কাজ যথাক্রমে 15 দিনে এবং 25 দিনে শেষ করে। যদি B 5 দিন কাজ করার পর চলে যায়, তবে বাকি কাজ A কতদিনে শেষ করবে?", options: ["10 দিন", "12 দিন", "14 দিন", "18 দিন"], answer: 1 },

  { q: "একটি মোটর গাড়ি চালক ঘণ্টায় 60 কিলোমিটার গতিতে গেলে গন্তব্যস্থলে পৌঁছাতে 20 মিনিট দেরী হয় এবং 80 কিলোমিটার গতিতে গেলে 10 মিনিট আগে গন্তব্যস্থলে পৌঁছায়। তবে গন্তব্যস্থলের দূরত্ব কত?", options: ["60 কিমি", "80 কিমি", "90 কিমি", "120 কিমি"], answer: 3 },

  { q: "A একা একটি কাজ 12 দিনে এবং B একা সেই কাজটি 15 দিনে করতে পারে। A একা কাজটি শুরু করার 3 দিন পর B কাজে যোগ দেয়। তবে বাকি কাজ A এবং B একত্রে কতদিনে শেষ করবে?", options: ["4 দিন", "5 দিন", "6 দিন", "8 দিন"], answer: 1 },

  { q: "সংবিধানে কোন ধারায় হিন্দিকে সরকারী ভাষার স্বীকৃতি দেওয়া হয়?", options: ["৩৪০ নং ধারায়", "৩৪১ নং ধারায়", "৩৪২ নং ধারায়", "৩৪৩ নং ধারায়"], answer: 3 },

  { q: "সালোকসংশ্লেষে হিল বিকারক কোনটি?", options: ["ATP", "AD", "RUDP", "NADP"], answer: 3 },

  { q: "দুজন পুরুষ এবং দুজন মহিলা একটি টেবিলের উত্তর, দক্ষিণ, পূর্ব এবং পশ্চিমে বসে তাস খেলছে। একজন পুরুষের সঙ্গী একজন মহিলা কিন্তু কোনও মহিলা পূর্বদিকে মুখ করে না থাকলেও একজন পুরুষ দক্ষিণদিকে মুখ করে বসেছে। তবে মহিলা দুজন কোনদিকে মুখ করে বসেছে?", options: ["উত্তর এবং পূর্ব", "উত্তর এবং পশ্চিম", "পূর্ব এবং দক্ষিণ", "দক্ষিণ এবং পশ্চিম"], answer: 1 },

  { q: "এক ব্যক্তি একটি দ্রব্য 10% লাভে বিক্রয় করে। যদি দ্রব্যটি আরও 200 টাকা কমে বিক্রয় করা হত, তাহলেও 8% লাভ হত। তবে দ্রব্যটির ক্রয়মূল্য কত?", options: ["9000 টাকা", "10000 টাকা", "10500 টাকা", "11000 টাকা"], answer: 1 },

  { q: "বাংলায় আদিনা মসজিদ কে তৈরি করেন?", options: ["হামজা শাহ", "সিকান্দার শাহ", "আজম শাহ", "ইলিয়াস শাহ"], answer: 1 },

  { q: "কোন বিশ্রাম ছাড়াই এক ব্যক্তি ঘন্টায় 42 কিলোমিটার গড় গতিবেগে গন্তব্যস্থলে যায় এবং বিশ্রাম সহ ঘন্টায় 28 কিলোমিটার গড় গতিবেগে গন্তব্যস্থলে পৌঁছলে, ওই ব্যক্তি ঘন্টায় কত মিনিট করে বিশ্রাম নেন?", options: ["14 মিনিট", "15 মিনিট", "20 মিনিট", "28 মিনিট"], answer: 2 },

  { q: "চর্যাপদের পুঁথিগুলো কে আবিষ্কার করেন?", options: ["হরপ্রসাদ শাস্ত্রী", "বিজয় গুপ্ত", "বড়ু চণ্ডীদাস", "ঘনরাম চক্রবর্তী"], answer: 0 },

  { q: "এক ব্যক্তি একটি দ্রব্য 14% লাভে বিক্রয় করে। যদি ক্রয়মূল্য ও বিক্রয়মূল্য উভয় 117 টাকা করে কম হত, তখন আরও 9% বেশী লাভ হয়। তবে দ্রব্যটির ক্রয়মূল্য কত?", options: ["199 টাকা", "299 টাকা", "349 টাকা", "399 টাকা"], answer: 1 },

  { q: "নিচের চারটি সংখ্যার মধ্যে কোন সংখ্যাটি আলাদা?", options: ["35", "37", "23", "19"], answer: 0 },

  { q: "একজন ব্যক্তি ঘন্টায় 4 কিমি গতিতে হেঁটে গন্তব্যস্থলে পৌঁছায় এবং 5 কিমি গতিতে ঘোড়ায় চেপে ফিরে আসে। সমগ্র যাত্রাপথে তার 9 ঘন্টা সময় লাগলে গন্তব্যস্থলের দূরত্ব কত ছিল?", options: ["15 কিমি", "18 কিমি", "20 কিমি", "25 কিমি"], answer: 2 },

  { q: "অটোস্কোপ যন্ত্রটি কোথায় ব্যবহার করা হয়?", options: ["কানের পর্দার পরীক্ষায়", "দাঁতের পরীক্ষায়", "নাকের পরীক্ষায়", "চোখের পরীক্ষায়"], answer: 0 },

  { q: "4.50 টাকা লিটার দরে খাঁটি দুধ কিনে 32 লিটার জলের সঙ্গে কত লিটার দুধ মেশালে 1.50 টাকা লিটার দরে বিক্রি করা যাবে?", options: ["14 লিটার", "16 লিটার", "18 লিটার", "20 লিটার"], answer: 1 },

  { q: "পোকামাকড় দেখে ভয় পাওয়াকে কী বলা হয়?", options: ["গ্রাফোফোবিয়া", "এন্টোমোফোবিয়া", "হাইড্রোফোবিয়া", "পাইরোফোবিয়া"], answer: 1 }
];
