const questions = [
  { q: "কে 'অমিত্রাঘাত' নামে পরিচিত ছিলেন?", options: ["বিম্বিসার", "অশোক", "বিন্দুসার", "কালাশোক"], answer: 2 },

  { q: "The old man is blind ______ an eye.", options: ["to", "of", "in", "by"], answer: 1 },

  { q: "যদি (A+B)-এর 15% = (A-B)-এর 25% হয়, তবে A, B-এর কত শতাংশ? [EXCISE/LADY]", options: ["250%", "300%", "110%", "400%"], answer: 3 },

  { q: "8, 17, 26, 35, ? — প্রশ্নবোধক চিহ্নের স্থানে কী বসবে?", options: ["39", "42", "52", "44"], answer: 3 },

  { q: "কোন্ ভারতীয় শাসক 'দীন-ই-ইলাহী' প্রবর্তন করেছিলেন?", options: ["শেরশাহ", "আকবর", "অশোক", "ঔরঙ্গজেব"], answer: 1 },

  { q: "Find the word which has the same meaning as 'Commendable'.", options: ["Laudable", "Viable", "Edible", "Ignoble"], answer: 0 },

  { q: "16 জনের গড় বয়স 20 বছর। তাদের মধ্যে একজন নতুন ব্যক্তি আসে। ফলে সবার গড় বয়স 2 বছর বেড়ে যায়। নতুন ব্যক্তির বয়স কত? [WBP Constable Main 2019]", options: ["52 বছর", "54 বছর", "14 বছর", "37 বছর"], answer: 1 },

  { q: "4, 6, 10, 16, 24, ? — কোন সংখ্যাটি নীচের সিরিজটিকে সম্পূর্ণ করবে?", options: ["40", "28", "30", "34"], answer: 3 },

  { q: "ভারতের প্রথম ভাইসরয় ছিলেন—", options: ["লর্ড ক্যানিং", "লর্ড কার্জন", "লর্ড ডাফরিন", "লর্ড আরউইন"], answer: 0 },

  { q: "Choose the correct form of verb: Nobody ______ a liar.", options: ["believe", "believes", "has believed", "believing"], answer: 1 },

  { q: "A এবং B-এর বর্তমান বয়সের অনুপাত 5 : 6, 7 বছর পর এই অনুপাতটি 6 : 7-এ দাঁড়ায়। A-এর বর্তমান বয়স কত? [KP SI/SERGEANT 2021]", options: ["32 বছর", "33 বছর", "35 বছর", "30 বছর"], answer: 2 },

  { q: "48, 24, 96, 48, 192, ? — প্রশ্নবোধক স্থানে কী বসবে?", options: ["98", "76", "96", "90"], answer: 2 },

  { q: "কোন্ পর্বতশ্রেণি মণিপুর রাজ্যকে নাগাল্যান্ড থেকে পৃথক করেছে?", options: ["আরাকান", "বরাইল", "পাটকাই", "লুসাই"], answer: 1 },

  { q: "Find the word that means 'one who has no belief in God'.", options: ["Theist", "Atheist", "Gallant", "Bigot"], answer: 1 },

  { q: "সরল সুদের কোন হারে একটি আসল 4 বছরে দ্বিগুণ হবে? [Excise Constable Main 2019]", options: ["25%", "28%", "20%", "30%"], answer: 0 },

  { q: "3, 7, 23, 95, ? — প্রশ্নবোধক স্থানে কোন সংখ্যাটি বসবে?", options: ["62", "128", "479", "575"], answer: 2 },

  { q: "পীরপঞ্জাল হিমালয়ের কোন্ অংশে অবস্থিত?", options: ["শিবালিক", "মধ্য হিমালয়", "উচ্চ হিমালয়", "ট্রান্স হিমালয়"], answer: 1 },

  { q: "Find the opposite of 'Amicable'.", options: ["Friendly", "Civil", "Meek", "Hostile"], answer: 3 },

  { q: "একজন ব্যক্তি 400টি কমলালেবু ক্রয় করে, সমগ্র ক্রয়মূল্যে 320টি কমলালেবু বিক্রয় করে। তার শতকরা কত লাভ হল? [WBP Constable Main 2019]", options: ["20%", "15%", "30%", "25%"], answer: 3 },

  { q: "Hemoglobin : Iron :: Chlorophyll : ?", options: ["Copper", "Magnesium", "Cobalt", "Calcium"], answer: 1 },

  { q: "'ব্লু মাউন্টেন' অঞ্চলে কোন্ ধরনের উপজাতি দেখা যায়?", options: ["গোন্ড", "জারোয়া", "টোডা", "লাম্বাড়া"], answer: 2 },

  { q: "Find the word that means 'Vicious'.", options: ["Sinister", "Benevolent", "Moral", "Honest"], answer: 0 },

  { q: "পল্লবী 500 টাকা 9 মাসের জন্য একটি ব্যবসায় বিনিয়োগ করে এবং পার্থ ওই একই ব্যবসায় 600 টাকা 5 মাসের জন্য বিনিয়োগ করে। তাহলে, তাদের লভ্যাংশের অনুপাত কত? [SOI 2022]", options: ["2 : 1", "4 : 1", "6 : 5", "3 : 2"], answer: 3 },

  { q: "January : November :: Sunday : ?", options: ["Thursday", "Friday", "Monday", "Wednesday"], answer: 1 },

  { q: "বিশ্ব স্বাস্থ্য সংস্থা (WHO)-এর সদর দপ্তর কোথায় অবস্থিত?", options: ["প্যারিস", "নিউইয়র্ক", "জেনেভা", "ভিয়েনা"], answer: 2 },

  { q: "The man has decided to divide his property ______ his twin sons.", options: ["between", "among", "by", "after"], answer: 0 },

  { q: "একটি ট্রেন একটি প্ল্যাটফর্মকে ও প্ল্যাটফর্মে দাঁড়ানো এক মহিলাকে যথাক্রমে 40 সেকেন্ড ও 30 সেকেন্ডে অতিক্রম করে। ট্রেনটির গতিবেগ যদি 108 কিমি/ঘণ্টা হয়, তবে প্ল্যাটফর্মের দৈর্ঘ্য কত? [Excise Main 2019]", options: ["300 মিটার", "900 মিটার", "100 মিটার", "1020 মিটার"], answer: 0 },

  { q: "Influenza : Virus :: Typhoid : ?", options: ["Parasite", "Bacteria", "Protozoa", "Bacillus"], answer: 1 },

  { q: "'পুষ্কর' মেলাটি কোন্ রাজ্যে অনুষ্ঠিত হয়?", options: ["গুজরাট", "মহারাষ্ট্র", "মধ্যপ্রদেশ", "রাজস্থান"], answer: 3 },

  { q: "It has been raining ______ three hours.", options: ["since", "from", "for", "by"], answer: 2 },

  { q: "স্রোতের অনুকূলে একটি নৌকা 6 মিনিটে 1 কিমি যায়। স্রোতের প্রতিকূলে যদি নৌকাটি প্রতি ঘণ্টায় 6 কিমি যায়, তবে স্রোতের গতিবেগ কত? [SOI 2022, KP Constable Prelims 2023]", options: ["4 কিমি/ঘণ্টা", "5 কিমি/ঘণ্টা", "3 কিমি/ঘণ্টা", "2 কিমি/ঘণ্টা"], answer: 3 },

  { q: "নীচের দেওয়া শব্দজোড়গুলিতে পরস্পর ভিন্ন সম্পর্কযুক্ত শব্দজোড় কোনটি?", options: ["গাড়ি : রাস্তা", "রকেট : মহাকাশ", "জাহাজ : সমুদ্র", "এরোপ্লেন : চালক"], answer: 3 },

  { q: "'নবকলেবর' উৎসবটি কোথায় পালিত হয়?", options: ["পশ্চিমবঙ্গ", "তামিলনাড়ু", "ওড়িশা", "সিকিম"], answer: 2 },

  { q: "The synonym of 'Indifferent' is—", options: ["Neutral", "Unkind", "Precious", "Interested"], answer: 0 },

  { q: "এক ব্যক্তি একটি কাজ 5 দিনে করতে পারে। কিন্তু তার ছেলের সাহায্য নিলে কাজটি 3 দিনে সম্পন্ন হয়। তার ছেলে একা কত দিনে কাজটি করতে পারবে? [Excise Main 2019]", options: ["7 দিনে", "7.5 দিনে", "6.5 দিনে", "8 দিনে"], answer: 1 },

  { q: "7 : 49 :: 17 : ?", options: ["289", "290", "324", "119"], answer: 0 },

  { q: "নিম্নলিখিত কোন্ নৃত্যটি লোকনৃত্য (Folk Dance) নয়?", options: ["মোহিনীঅট্টম", "রাউফ", "ঘুমর", "লাভানি"], answer: 0 },

  { q: "Antonym of 'Absurd' is—", options: ["Scarcity", "Adorn", "Rational", "Insane"], answer: 2 },

  { q: "25 জন লোক 4 দিনে আয় করে 810 টাকা। 12 জন লোক 15 দিনে কত টাকা আয় করবে? [WBP Constable Main 2019]", options: ["1560 টাকা", "1458 টাকা", "1700 টাকা", "1638 টাকা"], answer: 1 },

  { q: "Z = 1, A = 26 এবং GOAT = 65 হলে, FATI = ?", options: ["82", "72", "68", "78"], answer: 1 },

  { q: "কলমকারি চিত্রের উদ্ভব হয়েছে কোথায়?", options: ["তেলেঙ্গানা", "কেরালা", "তামিলনাড়ু", "অন্ধ্রপ্রদেশ"], answer: 3 },

  { q: "I = 9 এবং SLIP = 56 হলে, TASK = ?", options: ["51", "39", "40", "41"], answer: 0 },

  { q: "জাকির হোসেন কোন্ ক্ষেত্রে জড়িত?", options: ["সাহিত্য", "চিত্রকলা", "ভাস্কর্য", "সঙ্গীত"], answer: 3 },

  { q: "লুপ্ত সংখ্যাটি নির্ণয় করুন: প্রথম ত্রিভুজের বাইরে 5, 6, 4 এবং ভিতরে 12। দ্বিতীয় ত্রিভুজের বাইরে 10, 4, 9 এবং ভিতরে 36। তৃতীয় ত্রিভুজের বাইরে 15, 6, 7 এবং ভিতরে কত?", options: ["48", "63", "60", "42"], answer: 1 },

  { q: "ভারতের সংবিধান কার দ্বারা গৃহীত হয়?", options: ["ভারতীয় জাতীয় কংগ্রেস", "ভারতীয় লিগ", "ভারতের গণপরিষদ", "কোনোটিই নয়"], answer: 2 },

  { q: "প্রশ্নবোধক চিহ্নের স্থানে কী বসবে? প্রথম সারি: 7, 4, 5। দ্বিতীয় সারি: 8, 7, 6। তৃতীয় সারি: 3, 3, ?। চতুর্থ সারি: 29, 19, 31।", options: ["6", "4", "3", "5"], answer: 3 },

  { q: "ভারতের সুপ্রিম কোর্টের বিচারক নিযুক্ত হওয়ার জন্য কত বছর উচ্চ আদালতে অনুশীলন করা উচিত?", options: ["10 বছর", "12 বছর", "15 বছর", "20 বছর"], answer: 0 },

  { q: "P বিন্দুটি A বিন্দুর 10 মিটার পশ্চিমে অবস্থিত। B বিন্দুটি P বিন্দুর 2 মিটার দক্ষিণে অবস্থিত। Q বিন্দুটি B বিন্দুর 6 মিটার পূর্বে অবস্থিত এবং C বিন্দুটি Q বিন্দুর 2 মিটার উত্তরে অবস্থিত হলে, নীচের কোন তিনটি বিন্দু একই সরলরেখায় থাকবে?", options: ["A, C, P", "Q, C, A", "A, B, Q", "B, C, P"], answer: 0 },

  { q: "নীচের কোনটি তাপমাত্রার একক নয়?", options: ["ফারেনহাইট", "সেলসিয়াস", "কেলভিন", "পাসকাল"], answer: 3 },

  { q: "A-র ঘর থেকে হাসপাতাল 12 km পূর্বদিকে অবস্থিত। তার স্কুল হাসপাতাল থেকে 5 km দক্ষিণ দিকে অবস্থিত হলে, A-এর ঘর থেকে স্কুলের মধ্যে ন্যূনতম দূরত্ব কত?", options: ["17 km", "13 km", "12 km", "16 km"], answer: 1 }
];
